# This is a comment
test00
test01 # comment

# Double quotes
test02 10 "Hello" 20 # comment

# Don't trim "Hello "
test03 10 20 "Hello 
\"World\"" 30 40 # comment

# Single quotes
test04 'Hello 
\'World\\\' \\ \a\b\c'

# Keep parsing args
test05 "Hello
World" 10 20

# Special quote to change the terminator
test06 %^Hello \^
World^
test07 %(Hello (\)
World)
test08 %/Hello \/ World/
test09 %<Hello \> World>
test10 %[Hello \] World]
test11 %{Hello \} World}

# Heredoc
test12 <<EOS
    Hello      
      World    
Everybody!
E
EOS?

EOS

# Heredoc tag can be indented
test13 <<EOS
    Hello      
      World    
  EOS

# Keep parsing args
test14 <<EOS
    Hello      
      World    
  EOS 10 20

# Heredoc text indention can be cut
test15 <<-EOS
    Hello      
      World    
  EOS
test16 <<-EOS
    Hello      
      World    
 Lowest
  EOS
test17 <<-EOS
    Hello      
      World    

  EOS
test18 <<-EOS
    These are all
    on the same line.
    Don't you like
    heredoc?
      -Shakespeare
  EOS

# Heredoc with 1 char
test19 <<E
  Hello World
E?
E
test20 <<-E
  Hello World
  E
test21 <<-E
  Hello World
  E 10 20

# 1 char args with EOL & spaces
test22 1 2
 test23
  test24

# Methods with weird comments
def my_method1#comment
  test25 "Hello World"#comment
  test26#comment
  test27 1 2#comment
  test28 12 345#comment
end#comment

def my_method2#comment
  call my_method1#comment
  test29#comment
  test30 Yes#comment
  test31 '---'#comment
  test32 <<-EOS#comment
      The
      End
    EOS #comment
end#comment

call my_method1 my_method2#comment

# Heredoc with weird comments
test33 <<-EOS #comment
    Hello World
  EOS#comment
